void Lencoder()
{
  lpulse=micros()-ltime;                               // время между последними двумя прерываниями
  ltime=micros();                                      // время последнего срабатывания
  lcount++;                                            // счетчик левого двигателя
}

void Rencoder()
{
  rpulse=micros()-rtime;                               // время между последними двумя прерываниями
  rtime=micros();                                      // время последнего срабатывания
  rcount++;                                            // счетчик правого двигателя
}

